TASKS = [
    {
        "id": 1,
        "title": "Граф",
        "category": "Графы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "1.1", "title": "Симметричный граф"},
            {"slug": "1.2", "title": "Ассиметричный граф"},
        ]
    },
    {
        "id": 2,
        "title": "Таблица истинности логические выражения",

        "category": "Логика",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "2.1", "title": "Таблица истинности логические выражения"}
\
        ]
    },
    {
        "id": 3,
        "title": "Поиск информации в связанных таблицах",
        "category": "Таблицы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "3.1", "title": "Поиск информации в связанных таблицах"}
        ]
    },
    {
        "id": 4,
        "title": "Неравномерное кодирование информации",

        "category": "Кодирование",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "4.1", "title": "Неравномерное кодирование информации"}
        ]
    },
    {
        "id": 5,
        "title": "Анализ и построение алгоритма обработки числа",

        "category": "Алгоритмы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "5.1", "title": "Десятичная система счисления"},
            {"slug": "5.2", "title": "Двоичная система счисления"},
            {"slug": "5.3", "title": "Другие системы счисления"}
        ]
    },
    {
        "id": 6,
        "title": "Черепашка",

        "category": "Алгоритмы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "6.1", "title": "Черепашка"}
        ]
    },
    {
        "id": 7,
        "title": "Равномерное кодирование графической и звуковой информации",

        "category": "Кодирование",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "7.1", "title": "Кодирование звуков"},
            {"slug": "7.2", "title": "Кодирование изображений"},
            {"slug": "7.3", "title": "Передача данных"}
        ]
    },
    {
        "id": 8,
        "title": "Комбинаторика",

        "category": "Комбинаторика",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "8.1", "title": "Подсчет комбинаций"},
            {"slug": "8.2", "title": "Упорядоченный список"}

        ]
    },
    {
        "id": 9,
        "title": "Обработка числовой информации в электронных таблицах",

        "category": "Таблицы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "9.1", "title": "Обработка числовой информации в электронных таблицах"}
        ]
    },
    {
        "id": 10,
        "title": "Поиск в текстовом редакторе",

        "category": "Текст",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "10.1", "title": "Поиск в текстовом редакторе"},

        ]
    },
    {
        "id": 11,
        "title": "Равномерное кодирование текстовой информации",

        "category": "Кодирование",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "11.1", "title": "Равномерное кодирование текстовой информации"}
        ]
    },
    {
        "id": 12,
        "title": "Машина Тьюринга",

        "category": "Алгоритмы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "12.1", "title": "Машина Тьюринга"}
        ]
    },
    {
        "id": 13,
        "title": "Маска подсети",

        "category": "Сети",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "13.1", "title": "Маска подсети"}
        ]
    },
    {
        "id": 14,
        "title": "Системы счисления",

        "category": "Числовые системы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "14.1", "title": "Длинная арифметика"},
            {"slug": "14.2", "title": "Выражения с неизвестными цифрами"}
        ]
    },
    {
        "id": 15,
        "title": "Алебра логики",

        "category": "Логика",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "15.1", "title": "Отрезки"},
            {"slug": "15.2", "title": "Множества"},
            {"slug": "15.3", "title": "Битовые операции"},
            {"slug": "15.4", "title": "Графики"},
            {"slug": "15.5", "title": "Арифметические операции"},
            {"slug": "15.6", "title": "Смешанные операции"},
        ]
    },
    {
        "id": 16,
        "title": "Рекурсия",

        "category": "Алгоритмы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "16.1", "title": "Рекурсия"}
        ]
    },
    {
        "id": 17,
        "title": "Обработка числовой последовательности в файле",

        "category": "Файлы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "17.1", "title": "Обработка числовой последовательности в файле"}
        ]
    },
    {
        "id": 18,
        "title": "Робот в электронных таблицах",

        "category": "Таблицы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "18.1", "title": "Робот в электронных таблицах"}
        ]
    },
    {
        "id": 19,
        "title": "Теория игр-1",

        "category": "Теория игр",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "19.1", "title": "Одна куча камней"},
            {"slug": "19.2", "title": "Две кучи камней"}
        ]
    },
    {
        "id": 20,
        "title": "Теория игр-2",

        "category": "Теория игр",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "20.1", "title": "Одна куча камней"},
            {"slug": "20.2", "title": "Две кучи камней"}
        ]
    },
    {
        "id": 21,
        "title": "Теория игр-3",

        "category": "Теория игр",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "21.1", "title": "Одна куча камней"},
            {"slug": "21.2", "title": "Две кучи камней"}
        ]
    },
    {
        "id": 22,
        "title": "Параллельные процессы",

        "category": "Процессы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "22.1", "title": "Параллельные процессы"}
        ]
    },
    {
        "id": 23,
        "title": "Подсчет количества маршрутов в графе",

        "category": "Графы",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "23.1", "title": "Подсчёт маршрутов"}
        ]
    },
    {
        "id": 24,
        "title": "Обработка строк",

        "category": "Строки",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "24.1", "title": "Обработка строк"}
        ]
    },
    {
        "id": 25,
        "title": "Обработка числовой последовательности в диапазоне",

        "category": "Последовательности",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "25.1", "title": "Маски"},
            {"slug": "25.2", "title": "Делители"}
        ]
    },
    {
        "id": 26,
        "title": "Моделирование и обработка данных с использованием сортировки",

        "category": "Сортировка",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "26.1", "title": "Жадный алгоритм"},
            {"slug": "26.2", "title": "Сортировка с выбором последовательности"},
            {"slug": "26.3", "title": "Сортировка по нескольким столбцам"},
            {"slug": "26.4", "title": "Хронология"},
            {"slug": "26.5", "title": "Авторские задачи"}
            
        ]
    },
    {
        "id": 27,
        "title": "Анализ данных",

        "category": "Анализ данных",
        "placeholder_text": "Здесь будет текст задания из базы данных.",
        "variants": [
            {"slug": "27.1", "title": "Анализ данных"},

        ]
    }
]
